In [1]:
import numpy as np
import pandas as pd

In [71]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [121]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  0  2  9  7
1  5  7  8  3
2  0  0  9  3

In [122]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [123]:
np.sin(df * np.pi / 4)

          A         B             C         D
0  0.000000  1.000000  7.071068e-01 -0.707107
1 -0.707107 -0.707107 -2.449294e-16  0.707107
2  0.000000  0.000000  7.071068e-01  0.707107

In [126]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name='population')

In [127]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [128]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [129]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [130]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [131]:
list('AB')

['A', 'B']

In [132]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('AB'))
A

    A  B
0  11  6
1   1  2

In [133]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  0  4  0
1  7  0  0
2  1  1  5

In [134]:
A + B

      A    B   C
0  15.0  6.0 NaN
1   1.0  9.0 NaN
2   NaN  NaN NaN

In [137]:
fill = A.stack()
fill

0  A    11
   B     6
1  A     1
   B     2
dtype: int32

In [140]:
fill = A.stack().mean()
fill

5.0

In [141]:
A.add(B, fill_value=fill)

      A    B     C
0  15.0  6.0   5.0
1   1.0  9.0   5.0
2   6.0  6.0  10.0

In [142]:
A = rng.randint(10, size=(3, 4))
A

array([[6, 4, 0, 0],
       [2, 1, 4, 9],
       [5, 6, 3, 6]])

In [152]:
A - A[:,[0]]

array([[ 0, -2, -6, -6],
       [ 0, -1,  2,  7],
       [ 0,  1, -2,  1]])

In [153]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-4, -3,  4,  9],
       [-1,  2,  3,  6]])

In [156]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -4 -3  4  9
2 -1  2  3  6

In [159]:
df.subtract(df['R'], axis=0)

   Q  R  S  T
0  2  0 -4 -4
1  1  0  3  8
2 -1  0 -3  0

In [160]:
halfrow = df.iloc[0, ::2]
halfrow

Q    6
S    0
Name: 0, dtype: int32

In [161]:
df

   Q  R  S  T
0  6  4  0  0
1  2  1  4  9
2  5  6  3  6

In [162]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -4.0 NaN  4.0 NaN
2 -1.0 NaN  3.0 NaN

In [168]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [169]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
53.8 ms ± 425 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
1.7 ms ± 16.7 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [170]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [171]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [172]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(8.0, 1.0, 4.0)

In [173]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [181]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [183]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [184]:
data = pd.Series([1, np.nan, 'hello', None])

In [190]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [191]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [192]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [193]:
data.dropna()

0        1
2    hello
dtype: object

In [194]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [195]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [197]:
df.dropna(axis = 0)

     0    1  2
1  2.0  3.0  5

In [198]:
df.dropna(axis = 1)

   2
0  2
1  5
2  6

In [199]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [200]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [201]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [202]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [203]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [204]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [205]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [206]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [207]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0